PRIMARY_ATTRIBUTES_DISTRIBUTION = {
    '时之沙': {
        '生命值%': 0.2668,
        '攻击力%': 0.2666,
        '防御力%': 0.2666,
        '元素充能效率': 0.1,
        '元素精通': 0.1
    }, 
    '空之杯': {
        '生命值%': 0.1925,
        '攻击力%': 0.1925,
        '防御力%': 0.19,
        '元素精通': 0.025,
        '元素伤害加成': 0.05 * 8
    }, 
    '理之冠': {
        '生命值%': 0.22,
        '攻击力%': 0.22,
        '防御力%': 0.22,
        '元素精通': 0.04,
        '暴击率': 0.1,
        '暴击伤害': 0.1,
        '治疗加成': 0.1
    }
}


PRIMARY_ATTRIBUTES_INITIAL_VALUE = {
    '生命值': 717,
    '攻击力': 47,
    '生命值%': 0.07,
    '攻击力%': 0.07,
    '防御力%': 0.087,
    '元素精通': 28,
    '元素充能效率': 0.078,
    '物理伤害加成': 0.087,
    '元素伤害加成': 0.07,
    '暴击率': 0.047,
    '暴击伤害': 0.093,
    '治疗加成': 0.054
}

SUB_ATTRIBUTES_INITIAL_VALUE = {
    '生命值': 209,
    '攻击力': 13,
    '防御力': 16,
    '生命值%': 0.04,
    '攻击力%': 0.04,
    '防御力%': 0.05,
    '元素精通': 28,
    '元素充能效率': 0.045,
    '暴击率': 0.027,
    '暴击伤害': 0.054,
}

SUB_ATTRIBUTES_INITIAL_RATIO = (7, 8, 9, 10)

SUB_ATTRIBUTES_COUNT_POSSIBILITY_DISTRIBUTION = {
    'n': 0.8,
    'n + 1': 0.2
}

COMPOUNDED_SUB_ATTRIBUTES_COUNT_POSSIBILITY_DISTRIBUTION = {
    'n': 0.66,
    'n + 1': 0.34
}

SUB_ATTRIBUTE_WEIGHT = {
    '生命值': 150,
    '攻击力': 150,
    '防御力': 150,
    '生命值%': 100,
    '攻击力%': 100,
    '防御力%': 100,
    '元素充能效率': 100,
    '元素精通': 100,
    '暴击率': 75,
    '暴击伤害': 75
}

ARTIFACT_MAX_LEVEL = 20
UPGRADE_POINTS = (4, 8, 12, 16, 20)
ARTIFACT_MAX_SUB_ATTRIBUTES_COUNT = 4
SUB_ATTRIBUTE_UPGRADE_INTERVAL = int((UPGRADE_POINTS[-1] - UPGRADE_POINTS[0]) / (len(UPGRADE_POINTS) - 1))


PRIMARY_ATTRIBUTE_INCREAMENT = {
    '生命值': 203.15,
    '攻击力': 13.2,
    '生命值%': 0.0198,
    '攻击力%': 0.0198,
    '防御力%': 0.0248,
    '元素精通': 7.95,
    '元素充能效率': 0.022,
    '物理伤害加成': 0.0248,
    '元素伤害加成': 0.0198,
    '暴击率': 0.0132,
    '暴击伤害': 0.02645,
    '治疗加成': 0.01525
}
